Repository: lucas-net-pl/ls-config
Catalog: src/po/*.po
Languages: pl_pl

source: Configuration file handling
pl_pl: Obsluga plików konfiguracyjnych

source: Usage: ls-config [OPTION]
pl_pl: Składnia: ls-config [OPCJA]

source: Reading and writening data from configuration files
pl_pl: Odczytuje i zapisuje pliki konfiguracyjne

source: in libconfig9 format.
pl_pl: w formacie libconfig9.

source: CAUTION: using without given config file are cause error!
pl_pl: UWAGA: użycie bez podania pliku konfiguracyjnego powoduje błąd!

source: Available options:
pl_pl: Dostępne opcje:

source: -f, --file=FILE Configuration file to handle.
pl_pl: -f, --file=PLIK Plik konfiguracyjny do obsłużenia.

source: -s, --set=PATH Set configuration variable of given path.
pl_pl: -s, --set=SCIEZKA Ustawia zmienną konfiguracyjną o podanej ścieżce.

source: -d, --data=DATA Configuration variable value (only with -s)
pl_pl: -d, --data=DANE Wartość zmiennej konfiguracyjnej (tylko z -s).

source: -p, --type=TYPE Configuration value type
pl_pl: -p, --type=TYP Typ wartości konfiguracyjnej.

source: -g, --get=PATH Get configuration variable of given path.
pl_pl: -g, --get=SCIEZKA Pobież zmienną konfiguracyjną o podajen ścieżce.

source: -n, --names Printout variables names.
pl_pl: -n, --names Wypisz nazwy zmiennych.

source: -t, --types Printout variables types.
pl_pl: -t, --types Wypisz typy zmiennych.

source: -v, --values Printout variables values.
pl_pl: -v, --values Wypisz wartości zmiennych.

source: -i, --indexes Printout variables indexes.
pl_pl: -i, --indexes Wypisz indexy zmiennych.

source: -c, --count Printout elements count (only: array, list, group).
pl_pl: -c, --count Wypisz liczy elementów (tylko: array, list, group).

source: -b, --bool-string Printout boolean variables as text.
pl_pl: -b, --bool-string Wypisz wartości logiczne tekstowo.

source: -q, --quiet Quiet output to use in scripts.
pl_pl: -q, --quiet Ciche wyjście do użcia w skryptach.

source: -h, --help Print this help message.
pl_pl: -h, --help Wyswietla niniejszy opis

source: TYPE: Variable types:
pl_pl: TYP: Typy zmiennej:

source: group - variables group,
pl_pl: group - grupa zmiennych.

source: array - array of variables,
pl_pl: array - tablica zmiennych (tego samego typu podstawowego),

source: list - list of variables,
pl_pl: list - lista zmiennych,

source: int - integer number,
pl_pl: int - liczba całkowita,

source: int64 - 64bit integer number,
pl_pl: int64 - liczba całkowita 64bitowa,

source: float - float point number,
pl_pl: float - liczba zmiennoprzecinkowa,

source: bool - boolean value,
pl_pl: bool - wartość logiczna,

source: string - character string.
pl_pl: string - łąńcuch znakowy.

source: Licence:
pl_pl: Licencja:

source: ERROR! Incorrect data format.
pl_pl: BŁĄD! Błędny format danych.

source: ERROR! Variable set failed.
pl_pl: BŁĄD! Nie udało sią ustawić zmiennej.

source: ERROR! Can't read configuration file.
pl_pl: BŁĄD! Nie można odczytać pliku konfiguracyjnego.

source: ERROR! Conviguration variable path not given.
pl_pl: BŁĄD! Nie podano ścieżki zmiennej konfiguracyjnej.

source: ERROR! Configuration variable value not given.
pl_pl: BŁĄD! Nie podano wartości zmiennej konfiguracyjnej.

source: ERROR! Inavlid configuration variable path.
pl_pl: BŁĄD! Błędna ścieżka zmiennej konfiguracyjnej.

source: ERROR! New named configuration variable can be added only to group element.
pl_pl: BŁĄD! Nowa nazwana zmienna konfiguracyjne może być dodana tylko do grupy.

source: ERROR! Configuration variable type not given.
pl_pl: BŁĄD! Nie podano typu zmiennej konfiguracyjnej.

source: ERROR! Inlegal data type.
pl_pl: BŁĄD! Niepoprawny typ zmiennej.

source: BLAD! Niezgodny typ zmiennej.
pl_pl: BŁĄD! Niezgodny typ zmiennej.

source: BLAD! Nie udalo sie ustawic zmiennej.
pl_pl: BŁĄD! Nie udało sią ustawić zmiennej.

source: BLAD! Nie okreslono typu zmiennej.
pl_pl: BŁĄD! Nie określono typu zmiennej.

source: BLAD! Niedozwolony typ zmiennej.
pl_pl: BŁĄD! Niedozwolony typ zmiennej.

source: Dodano pozycje: %d
pl_pl: Dodano pozycję: %d

source: BLAD! Bledna nazwa zmiennej konfiguracyjnej.
pl_pl: BŁĄD! Błędna nazwa zmiennej konfiguracyjnej.

source: BLAD! Zapisu pliku konfiguracyjnego.
pl_pl: BŁĄD! Zapisu pliku konfiguracyjnego.

source: BLAD! Nie mozna otworzyc pliku konfiguracyjnego.
pl_pl: BŁĄD! Nie można otworzyć pliku konfiguracyjnego.

source: BLAD! Nie podano sciezki zmiennej.
pl_pl: BŁĄD! Nie podano ścieżki zmiennej.

source: BLAD! Nie odnaleziono poszukiwanej konfiguracji.
pl_pl: BĄDD! Nie odnalexiono poszukiwanej konfiguracji.

source: BLAD! Nie mozna usunac glownego elementu.
pl_pl: BŁĄD! Nie można usunąć głównego elementu.

source: BLAD! Nie mozna znalezc elementu nadrzednego.
pl_pl: BŁĄD! Nie można znaleźć elementu nadrzędnego.

source: BLAD! Nie udalo sie usunac elementu.
pl_pl: BŁĄD! Nie udało się usunąć elementu.

source: Wartosc zmiennej: %s
pl_pl: Wartość zmiennej: %s

source: Index zmiennej: %d
pl_pl: Indeks zmiennej: %d

source: BLAD! Nie okreslono sciezki zmiennej.
pl_pl: BŁĄD! Nie określono ścieżki zmiennej.
